# Реализовать функцию, которая создаёт матрицу 
# размером M строк на N столбцов 
# и заполняет её рандомными числами.

import matrix
from pprint import pprint

mx = matrix.create()

pprint(mx)