"""
Есть три целочисленные переменные, нужно посчитать:
● сумму
● разность
● произведение
● от первой переменной отнять вторую и прибавить третью
● поделить произведение двух переменных на третью
● от суммы первых двух переменных найти остаток от деления на третью переменную
"""

(a, b, c) = (1, 2, 3)

print((a, b, c))
print("a + b + c = ", a + b + c)
print("a - b - c = ", a - b - c)
print("a * b * c = ", a * b * c)
print("a - b + c = ", a - b + c)
print("a * b / c = ", a * b / c)
print("(a + b) % c = ", (a + b) % c)
