# 8. JSON и CSV.
# Исходные данные:
# https://drive.google.com/drive/folders/1KH3pJewo3QKl3mua2XnJDv9xN2LxusbE?usp=sharing
# Пункты задания:
# • Есть данные в формате JSON – взять с диска с исходными данными.
# • Реализовать функцию, которая считает данные из исходного JSON-файла и преобразует их в формат CSV
# • Реализовать функцию, которая сохранит данные в CSV-файл 
#   (данные должны сохраняться независимо от их количества – если добавить в исходный JSON-файл ещё одного сотрудника, 
#   работа программы не должна нарушаться).
# • Реализовать функцию, которая добавит информацию о новом сотруднике в JSON-файл. 
#   Пошагово вводятся все необходимые данные о сотруднике, формируются данные для записи.
# • Такая же функция для добавления информации о новом сотруднике в CSV-файл.\
# • Реализовать функцию, которая выведет информацию об одном сотруднике по имени. Имя для поиска вводится с клавиатуры.
# • Реализовать функцию фильтра по языку: с клавиатуры вводится язык программирования, 
#   выводится список всех сотрудников, кто владеет этим языком программирования.
# • Реализовать функцию фильтра по году: ввести с клавиатуры год рождения, вывести средний рост всех сотрудников, у которых год рождения меньше заданного.
# • Программа должна представлять собой интерактив – пользовательское меню с возможностью выбора определённого действия 
#   (действия – функции из предыдущих пунктов + выход из программы). 
#   Пока пользователь не выберет выход из программы, должен предлагаться выбор следующего действия.

